# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [2]:
#Write your code here
import pandas as pd
df_data = pd.read_csv("Data/Purchase_Data.csv")
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [3]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [6]:
#Write you code here
result_1 = df_data.loc[:, ['invoice_number', 'invoice_time']]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [17]:
#Write you code here
result_2 = df_data.loc[:1,:]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [21]:
#Write your code here
result_3 = df_data.loc[:3, df_data.columns[:5]]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [22]:
#Write your code here
result_4 = df_data.loc[[0,4,6], ['invoice_time','price']]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [25]:
num_rows = df_data.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [31]:
#Write your code here
last_row = df_data.loc[num_rows-1:num_rows-1,:]
last_row

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [35]:
#Write your code here
avg_price = df_data["price"].mean() 
max_price = df_data["price"].max()  
print("avg price:", avg_price)
print("max price:", max_price)

avg price: 3.1920522110741363
max price: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [38]:
#Write you code here
avg_price, avg_num_items = df_data[["price", "num_item"]].mean()
print("avg price:", avg_price)
print("avg nums items:", avg_num_items)

avg price: 3.1920522110741363
avg nums items: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [39]:
#Write your code here
df_data["total"] = df_data["price"] * df_data["num_item"]

What is the avgerage price of the three most expensive purchases?

In [40]:
#Write your code here
avg_top3_price = df_data["price"].nlargest(3).mean()
print(avg_top3_price)

6.003333333333333

How many different products are there?

In [41]:
#Write your code here
num_unique_products = df_data["product_id"].nunique()
print(num_unique_products)

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [44]:
#Write your code here
stats = df_data["total"].describe()
mean_median_diff = stats["mean"] - stats["50%"]

print(mean_median_diff)

0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [45]:
#Write your code here
df_data = df_data.drop(columns=["total"])

Let's dig a little deeper into the data set and answer some basic question.

In [46]:
#Write your code here

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

/tmp/ipykernel_182630/2878558511.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"])

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [47]:
#Write your code here

df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"])

print(df_data.dtypes)

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [49]:
#Write your code here
df_data["DOW"] = df_data["invoice_time"].dt.day_name()
df_data["Month"] = df_data["invoice_time"].dt.month_name()
print(df_data.head())

   invoice_number        invoice_time store_id  product_id  category_id  \
0    2.020000e+11 2015-07-15 10:45:00     G816     7000300       210101
1    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
2    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
3    2.020000e+11 2015-07-15 12:16:00     G816     7070891        70401
4    2.020000e+11 2015-07-15 12:16:00     G816     7090363        70401

   num_item  price        DOW Month
0       1.0    2.0  Wednesday  July
1       1.0    2.0  Wednesday  July
2       1.0    2.0  Wednesday  July
3       1.0    6.0  Wednesday  July
4       1.0    6.0  Wednesday  July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [50]:
#Write your code here
num_purchases_wed = df_data["DOW"].value_counts()["Wednesday"]
print(num_purchases_wed)

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [51]:
#Write your code here
df = pd.read_csv("Data/Titanic.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [52]:
#Write your code here
df = df.rename(columns={"Name": "Passenger_Name", "Ticket": "Ticket_Num"})
print(df.head())

   PassengerId  Pclass                                Passenger_Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  34.5      0      0     330911   7.8292   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  62.0      0      0     240276   9.6875   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

Change the index of the df_titanic to the column PasengerID.

In [55]:
#Write your code here
df = df.set_index("PassengerId")

print(df.head())

             Pclass                                Passenger_Name     Sex  \
PassengerId
892               3                              Kelly, Mr. James    male
893               3              Wilkes, Mrs. James (Ellen Needs)  female
894               2                     Myles, Mr. Thomas Francis    male
895               3                              Wirz, Mr. Albert    male
896               3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

              Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
PassengerId
892          34.5      0      0     330911   7.8292   NaN        Q
893          47.0      1      0     363272   7.0000   NaN        S
894          62.0      0      0     240276   9.6875   NaN        Q
895          27.0      0      0     315154   8.6625   NaN        S
896          22.0      1      1    3101298  12.2875   NaN        S

Select the name of passenger 896

In [57]:
#Write your code here
passenger_896_name = df.loc[896, "Passenger_Name"]
print(passenger_896_name)

Hirvonen, Mrs. Alexander (Helga E Lindqvist)

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [59]:
#Write your code here
df = df.reset_index()
print(df.head())

   index  PassengerId  Pclass                                Passenger_Name  \
0      0          892       3                              Kelly, Mr. James
1      1          893       3              Wilkes, Mrs. James (Ellen Needs)
2      2          894       2                     Myles, Mr. Thomas Francis
3      3          895       3                              Wirz, Mr. Albert
4      4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

      Sex   Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0    male  34.5      0      0     330911   7.8292   NaN        Q
1  female  47.0      1      0     363272   7.0000   NaN        S
2    male  62.0      0      0     240276   9.6875   NaN        Q
3    male  27.0      0      0     315154   8.6625   NaN        S
4  female  22.0      1      1    3101298  12.2875   NaN        S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [60]:
#Write you code here
num_missing_age = df["Age"].isnull().sum()
print(num_missing_age)

86

Compute the avg age of passengers ignoring the missing data.

In [63]:
#Write your code here
avg_age = df["Age"].mean()
print(avg_age)

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [64]:
#Write your code here
df["Age"] = df["Age"].fillna(df["Age"].mean())
print(df.head())

   index  PassengerId  Pclass                                Passenger_Name  \
0      0          892       3                              Kelly, Mr. James
1      1          893       3              Wilkes, Mrs. James (Ellen Needs)
2      2          894       2                     Myles, Mr. Thomas Francis
3      3          895       3                              Wirz, Mr. Albert
4      4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

      Sex   Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0    male  34.5      0      0     330911   7.8292   NaN        Q
1  female  47.0      1      0     363272   7.0000   NaN        S
2    male  62.0      0      0     240276   9.6875   NaN        Q
3    male  27.0      0      0     315154   8.6625   NaN        S
4  female  22.0      1      1    3101298  12.2875   NaN        S

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [68]:
#Write your code here
avg_age_oldest = df.sort_values("Age", ascending=False).head(5)["Age"].mean()
print(avg_age_oldest)

67.0